EInstieg_dieDritte/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
     type               fixedValue;
     value              uniform ( 0 0 0.06287603 );

    }
    outlet
    {
      type              inletOutlet;
      inletValue        uniform ( 0 0 0 );
      value             uniform ( 0 0 0 );
    }

    wall1
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    wall2
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    wall3
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    wallInlet
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    wallOutlet
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    

}

// ************************************************************************* //
