EInstieg_dieDritte/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 2.5E-0.6;

boundaryField
{
    //- Set patchGroups for constraint patches


    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }


    wallInlet
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    wallOutlet
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    wall1
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    wall2
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    wall3
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
