EInstieg_dieDritte/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.83E-05;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }

    wallOutlet
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    wallInlet
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    wall1
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    wall2
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    wall3
    {
        type            kqRWallFunction;
        value           $internalField;
    }

}


// ************************************************************************* //
