EInstieg_dieDritte/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }

    wallInlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wall1
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wall2
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wall3
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wallOutlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }


}

// ************************************************************************* //
