EInstieg_dieDritte/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | OpenFOAM (Engys Edition):                                |
|   o   O   o      | Version: 2.2_engysEdition-2.4                            |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }


    wall1
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        rho             rhok;
        value           uniform 0;
    }
    wall2
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        rho             rhok;
        value           uniform 0;
    }
    wall3
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        rho             rhok;
        value           uniform 0;
    }
    wallInlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        rho             rhok;
        value           uniform 0;
    }
    wallOutlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        rho             rhok;
        value           uniform 0;
    }

}


// ************************************************************************* //
