EInstieg_dieDritte/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=`getApplication`

runApplication blockMesh
runApplication topoSet
runApplication refineHexMesh c0 -overwrite
cp -r 0.orig 0

#runApplication $application
runApplication decomposePar -cellDist
runParallel $application

runApplication reconstructPar

#------------------------------------------------------------------------------
