EInstieg_dieDritte/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0.1;
    }

    rhoFinal
    {
	$rho;
	tolerance 1e-06;
	relTol 0;
    }

    p
    {
      solver           GAMG;
      tolerance        1e-6;
      relTol           0.01;
      smoother         GaussSeidel;
      cacheAgglomeration  true;
      nCellsInCoarsestLevel 10;
      agglomerator     faceAreaPair;
      mergeLevels      1;
      maxIter          200;

    }

    pFinal
    {
        $p_rgh;
	tolerance 1e-6;
        relTol          0;
	maxIter   200;
    }

    p_rgh
    {
      solver           GAMG;
      tolerance        1e-6;
      relTol           0.01;
      smoother         GaussSeidel;
      cacheAgglomeration  true;
      nCellsInCoarsestLevel 10;
      agglomerator     faceAreaPair;
      mergeLevels      1;
      maxIter          200;

    }

    p_rghFinal
    {
        $p_rgh;
	tolerance 1e-6;
        relTol          0;
	maxIter   200;
    }
      "(U|h|e|k|epsilon|R|T)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|e|k|epsilon|R|T)Final"
    {
        $U;
        relTol          0;
    }

}

relaxationFactors
{
    fields
    {
        p               1;
        p_rgh           1;
        rho             1;
    }
    equations
    {
        U               1;
        h               1;
        T               1;
        k               1;
        epsilon         1;
        R               1;
        nuTilda         1;
        omega           1;
        kl              1;
        UFinal          1;
        hFinal          1;
        TFinal          1;
        kFinal          1;
        klFinal         1;
        nuTildaFinal    1;
        omegaFinal      1;
        epsilonFinal    1;
        RFinal          1;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;

    residualControl
    {
        "(U|k|epsilon|omega|nuTilda|T)"
        {
            relTol          0;
            tolerance       0.0001;
        }
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors    20;
}


// ************************************************************************* //
